W6/D3/art_share_api/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 10]]
---
  def create
    share = ArtworkShare.new(artwork_share_params)
    if share.save