W6/D3/art_share_api/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 9], ["id", 5]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)