W6/D3/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 9]]
---
  def index
    if !params.has_key?(:comment)
      comments = Comment.all
    elsif comment_params[:user_id].nil? && comment_params[:artwork_id]
      comments = Comment.where(artwork_id: comment_params[:artwork_id])
    elsif comment_params[:user_id] && comment_params[:artwork_id].nil?
      comments = Comment.where(user_id: comment_params[:user_id])