W7/D2/music_app/app/controllers/bands_controller.rb

  def update
    band = Band.find(params[:id])
    if band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Oasi"], ["updated_at", "2021-10-13 00:19:07.342717"], ["id", 4]]